models/User.php

public static function findIdentity($id)
{
return static::findOne($id);
---
SELECT * FROM `tbl_user` WHERE `id`=16

public static function findByUsername($email)
{
 return self::findOne(['full_name'=>$email]);
---
SELECT * FROM `tbl_user` WHERE `full_name`='admin'